app/Http/Controllers/EventController.php

    public function index()
    {
        $lang = session('lang', 'en');
        App::setlocale(session('lang'));

        return view('/event/index',[
            "title" => "Events",
            "events" =>Event::all()
        ]);
---
SELECT * FROM `events`

    public function show($id)
    {
        $event = Event::findOrFail($id);
---
SELECT * FROM `events` WHERE `events`.`id` = '1' LIMIT 1