app/Http/Controllers/HomeController.php

SELECT * FROM `stations`
SELECT * FROM `events` ORDER BY `created_at` DESC LIMIT 3
SELECT * FROM `promotions`
---
    public function index()
    {

        return view('home', [
            'title' => 'Home',
            'stations'=> Station::all(),
            'events' => Event::latest()->take(3)->get(),
            'promos' => Promotion::all()

SELECT `s1`.`train_id`, `s1`.`departure_time`, `s3`.`arrival_time`, `s1`.`origin_station_id`, `s3`.`destination_station_id`, `t`.`total_seat` FROM `schedules` as `s1` inner join `schedules` as `s2` on `s1`.`arrival_time` = `s2`.`departure_time` inner join `schedules` as `s3` on `s2`.`arrival_time` = `s3`.`departure_time` inner join `trains` as `t` on `s1`.`train_id` = `t`.`id` WHERE `s1`.`origin_station_id` = '1' and `s2`.`origin_station_id` = 2 and `s3`.`origin_station_id` = 3 and `s1`.`end_station_id` = 4 and `s2`.`end_station_id` = 4 and `s3`.`end_station_id` = 4 ORDER BY `s1`.`departure_time` ASC
---
        }

        if ($destination_station - $origin_station == 3) {
            $schedules = DB::table('schedules as s1')
                ->select('s1.train_id', 's1.departure_time', 's3.arrival_time', 's1.origin_station_id', 's3.destination_station_id', 't.total_seat')
                ->join('schedules as s2', 's1.arrival_time', '=', 's2.departure_time')
                ->join('schedules as s3', 's2.arrival_time', '=', 's3.departure_time')
                ->join('trains as t', 's1.train_id', '=', 't.id')
                ->where('s1.origin_station_id', $origin_station)
                ->where('s2.origin_station_id', $origin_station+1)
                ->where('s3.origin_station_id', $origin_station+2)
                ->where('s1.end_station_id', $end_station)
                ->where('s2.end_station_id', $end_station)
                ->where('s3.end_station_id', $end_station)
                ->orderBy('s1.departure_time')
                ->get();