app/Http/Controllers/HomeController.php

SELECT * FROM `schedules` WHERE `origin_station_id` = '3' and `destination_station_id` = '4' and `end_station_id` = 4
---
    public function search(Request $request)
    {
        $origin_station = $request->input('origin_station');
        $destination_station = $request->input('destination_station');

        if($origin_station < $destination_station){
            $end_station = 4;
        }
        else{
            $end_station = 1;
        }


        if(abs($destination_station-$origin_station) == 1){
            $schedules = Schedule::where('origin_station_id', $origin_station)
                            ->where('destination_station_id', $destination_station)
                            ->where('end_station_id', '=', $end_station)
                            ->get();