app/Http/Controllers/PromotionController.php

SELECT * FROM `promotions`
---
    public function index()
    {
        return view('/promo/index', [
            "title" => "Events",
            "promotions" => Promotion::all()

SELECT * FROM `promotions` WHERE `promotions`.`id` = '2' LIMIT 1
---
    public function show($id)
    {
        $promotion = Promotion::findOrFail($id);