app/Http/Controllers/ScheduleController.php

SELECT * FROM `schedules` WHERE `train_id` in (1, 2, 3) and `origin_station_id` in (1, 2, 3, 4)
---
    public function index()
    {

        $trainIds_right = [1, 2, 3];
        $trainIds_left = [4, 5, 6];
        $originStationIds = [1, 2, 3, 4];

        $schedules_right = Schedule::whereIn('train_id', $trainIds_right)
                            ->whereIn('origin_station_id', $originStationIds)
                            ->get();